admin.org
#+title: Guia para o administrador
#+author: Henrique Silva
#+email: hcpsilva@inf.ufrgs.br
#+options: tags:nil
#+language: pt_BR
#+infojs_opt:

Olá! Esta parte do guia é voltada à *administradores* de repositórios
criptografados. Se você for somente um usuário desse repositório, por favor leia
o guia disponível [[./user.org][aqui]].

O guia para o administrador esta organizado em *duas* partes:

- Primeira parte :: Aqui aborda o passo-a-passo relativo a criação e
  inicialização do repositório no nosso servidor remoto, algo que faremos uma só
  vez. Essa parte é abordada na seção [[Criação e inicialização]].

- Segunda parte :: Aqui abordamos tarefas recorrentes da administração de um
  repositório da existente, como a adição de usuários para colaborar num
  repositório e para ter acesso a quaisquer outros repositórios hospedados nesse
  servidor. Essa parte corresponde ao conteúdo da seção [[Tarefas recorrentes]].

* Sumário                                                         :TOC_3_org:
:PROPERTIES:
:UNNUMBERED: t
:END:
- [[Preâmbulo][Preâmbulo]]
  - [[=git=][=git=]]
  - [[=gnupg=][=gnupg=]]
  - [[=git-remote-gcrypt=][=git-remote-gcrypt=]]
  - [[=ecryptfs=][=ecryptfs=]]
  - [[=openssh=][=openssh=]]
- [[Criação e inicialização][Criação e inicialização]]
  - [[Criando um usuário][Criando um usuário]]
  - [[Criando um repositório][Criando um repositório]]
  - [[Inicializando a cópia local][Inicializando a cópia local]]
    - [[Criando um diretório criptografado][Criando um diretório criptografado]]
    - [[Criando a primeira versão][Criando a primeira versão]]
  - [[Configurando o usuário =gith=][Configurando o usuário =gith=]]
- [[Tarefas recorrentes][Tarefas recorrentes]]
  - [[Fornecendo acesso ao servidor][Fornecendo acesso ao servidor]]
  - [[Importando as chaves dos colaboradores][Importando as chaves dos colaboradores]]
  - [[Adicionando novos colaboradores a um repositório][Adicionando novos colaboradores a um repositório]]

* Preâmbulo

Antes de criar ou de trabalhar com esse servidor remoto, necessitaremos de
algumas ferramentas instaladas nas nossas máquinas:

- [[https://git-scm.com/][git]]
- [[https://gnupg.org/][GnuPG]]
- [[https://spwhitton.name/tech/code/git-remote-gcrypt/][git-remote-gcrypt]]
- [[https://ecryptfs.org/][eCryptfs]]
- [[https://www.openssh.com/][OpenSSH]]

Nessas subseções abordaremos o processo de instalação dessas ferramentas.

** =git=

Criada por Linus Torvalds a fim de versionar atualizações ao kernel linux, essa
ferramenta está presente em todos os repositórios de pacotes de quaisquer
distribuições.

Dependendo de sua distribuição GNU/Linux, faça o seguinte para instalar o
pacote:

- Debian/Ubuntu :: =sudo apt-get install git=
- Fedora :: =sudo yum install git=
- OpenSUSE :: =sudo zypper install git=
- Arch :: =sudo pacman -S git=
- Gentoo :: =sudo emerge --ask dev-vcs/git=

Se utilizar Windows 10, considere habilitar o
[[https://docs.microsoft.com/pt-br/windows/wsl/install-win10][subsistema Windows
para Linux]] ou instale Git for Windows através desse
[[https://git-scm.com/download/win][link]].

** =gnupg=

A implementação do grupo GNU da especificação OpenPGP é uma das ferramentas mais
populares para criptografia de dados e gerenciamento de chaves, e está presente
em virtualmente todos os repositórios de pacotes de grandes distribuições.

Para instalar, faça o seguintes comandos, dependendo de sua distribuição:

- Debian/Ubuntu :: =sudo apt-get install gnupg=
- Fedora :: =sudo yum install gnupg=
- OpenSUSE :: =sudo zypper install gnupg=
- Arch :: =sudo pacman -S gnupg=
- Gentoo :: =sudo emerge --ask app-crypt/gnupg=

** =git-remote-gcrypt=

Ferramenta que auxilia a criptografia completa de remotos utilizando chaves
públicas =gnupg= dos participantes do repositório.

Para instalar:

- Debian/Ubuntu :: =sudo apt-get install git-remote-gcrypt=
- AUR (Arch) :: =yay -Sa git-remote-gcrypt=

Caso você não utilize essas distribuições, siga os seguintes passos:

#+begin_src bash :exports code
# usuario@pc-local

git clone https://github.com/spwhitton/git-remote-gcrypt.git
cd git-remote-gcrypt
./install.sh
#+end_src

** =ecryptfs=

Chamado também de "gnupg para filesystems", essa é a ferramenta por trás da
criptografia do diretório Home nativa da distribuição Ubuntu. O código fonte da
ferramenta foi integrado no repositório do kernel Linux, e o pacote para a
utilização simples em linha de comando pode ser instalada da seguinte maneira:

- Debian/Ubuntu :: =sudo apt-get install ecryptfs-utils=
- Fedora :: =sudo yum install ecryptfs-utils=
- OpenSUSE :: =sudo zypper install ecryptfs-utils=
- Arch :: =sudo pacman -S ecryptfs-utils=
- Gentoo :: =sudo emerge --ask sys-fs/ecryptfs-utils=

Podemos agora facilmente criar um diretório privado para cada usuário utilizando
essas ferramentas, porém note que, utilizando interfaces menos simples, é
possível criar mais diretórios transparentes.

** =openssh=

Uma das implementações mais populares de ferramentas que utilizam o
protocolo SSH, a suite OpenSSH implementa vários programas essenciais para
quaisquer sistemas cliente-servidor.

- Debian/Ubuntu :: =sudo apt-get install openssh-server openssh-client=
- Fedora :: =sudo yum install openssh-server openssh=
- OpenSUSE :: =sudo zypper install openssh=
- Arch :: =sudo pacman -S openssh=
- Gentoo :: =sudo emerge --ask --changed-use net-misc/openssh=

* Criação e inicialização

A fim de administrar um servidor =git= e seus repositórios, precisamos, claro,
criar e inicializar a aparelhagem necessária para isso. As tarefas aqui estão
separadas somente para facilitar o entendimento desse guia, porém note que, se
não explicitado, todos os passos *precisam* ser seguidos.

