org-exports/admin.html
<!doctype html>
<html lang="pt_BR">
<head>
<title>Guia para o administrador</title>
<!-- 2020-02-21 sex 00:47 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Henrique Silva">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Guia para o administrador</h1>
<p>
Olá! Esta parte do guia é voltada à <b>administradores</b> de repositórios
criptografados. Se você for somente um usuário desse repositório, por favor leia
o guia disponível <a href="./user.html">aqui</a>.
</p>

<p>
O guia para o administrador esta organizado em <b>duas</b> partes:
</p>

<dl class="org-dl">
<dt> Primeira parte </dt><dd>Aqui aborda o passo-a-passo relativo a criação e
inicialização do repositório no nosso servidor remoto, algo que faremos uma só
vez. Essa parte é abordada na seção <a href="#sec-2">Criação e inicialização</a>.
</dd>

<dt> Segunda parte </dt><dd>Aqui abordamos tarefas recorrentes da administração de um
repositório da existente, como a adição de usuários para colaborar num
repositório e para ter acesso a quaisquer outros repositórios hospedados nesse
servidor. Essa parte corresponde ao conteúdo da seção <a href="#sec-3">Tarefas recorrentes</a>.
</dd>
</dl>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Sumário</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li><a href="#sec-1">Preâmbulo</a>
<ul class="org-ul">
<li><a href="#sec-1-1"><code>git</code></a>
</li>
<li><a href="#sec-1-2"><code>gnupg</code></a>
</li>
<li><a href="#sec-1-3"><code>git-remote-gcrypt</code></a>
</li>
<li><a href="#sec-1-4"><code>ecryptfs</code></a>
</li>
<li><a href="#sec-1-5"><code>openssh</code></a>
</li>
</ul>
</li>
<li><a href="#sec-2">Criação e inicialização</a>
<ul class="org-ul">
<li><a href="#sec-2-1">Criando um usuário</a>
</li>
<li><a href="#sec-2-2">Criando um repositório</a>
</li>
<li><a href="#sec-2-3">Inicializando a cópia local</a>
<ul class="org-ul">
<li><a href="#sec-2-3-1">Criando um diretório criptografado</a>
</li>
<li><a href="#sec-2-3-2">Criando a primeira versão</a>
</li>
</ul>
</li>
<li><a href="#sec-2-4">Configurando o usuário <code>gith</code></a>
</li>
</ul>
</li>
<li><a href="#sec-3">Tarefas recorrentes</a>
<ul class="org-ul">
<li><a href="#sec-3-1">Fornecendo acesso dos repositórios</a>
</li>
<li><a href="#sec-3-2">Importando as chaves dos colaboradores</a>
</li>
<li><a href="#sec-3-3">Adicionando novos colaboradores a um repositório</a>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Preâmbulo</h2>
<div class="outline-text-2" id="text-1">
<p>
Antes de criar ou de trabalhar com esse servidor remoto, necessitaremos de
algumas ferramentas instaladas nas nossas máquinas:
</p>

<ul class="org-ul">
<li><a href="https://git-scm.com/">git</a>
</li>
<li><a href="https://gnupg.org/">GnuPG</a>
</li>
<li><a href="https://spwhitton.name/tech/code/git-remote-gcrypt/">git-remote-gcrypt</a>
</li>
<li><a href="https://ecryptfs.org/">eCryptfs</a>
</li>
<li><a href="https://www.openssh.com/">OpenSSH</a>
</li>
</ul>

<p>
Nessas subseções abordaremos o processo de instalação dessas ferramentas.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <code>git</code></h3>
<div class="outline-text-3" id="text-1-1">
<p>
Criada por Linus Torvalds a fim de versionar atualizações ao kernel linux, essa
ferramenta está presente em todos os repositórios de pacotes de quaisquer
distribuições.
</p>

<p>
Dependendo de sua distribuição GNU/Linux, faça o seguinte para instalar o
pacote:
</p>

<dl class="org-dl">
<dt> Debian/Ubuntu </dt><dd><code>sudo apt-get install git</code>
</dd>
<dt> Fedora </dt><dd><code>sudo yum install git</code>
</dd>
<dt> OpenSUSE </dt><dd><code>sudo zypper install git</code>
</dd>
<dt> Arch </dt><dd><code>sudo pacman -S git</code>
</dd>
<dt> Gentoo </dt><dd><code>sudo emerge --ask dev-vcs/git</code>
</dd>
</dl>

<p>
Se utilizar Windows 10, considere habilitar o
<a href="https://docs.microsoft.com/pt-br/windows/wsl/install-win10">subsistema Windows
para Linux</a> ou instale Git for Windows através desse
<a href="https://git-scm.com/download/win">link</a>.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <code>gnupg</code></h3>
<div class="outline-text-3" id="text-1-2">
<p>
A implementação do grupo GNU da especificação OpenPGP é uma das ferramentas mais
populares para criptografia de dados e gerenciamento de chaves, e está presente
em virtualmente todos os repositórios de pacotes de grandes distribuições.
</p>

<p>
Para instalar, faça o seguintes comandos, dependendo de sua distribuição:
</p>

<dl class="org-dl">
<dt> Debian/Ubuntu </dt><dd><code>sudo apt-get install gnupg</code>
</dd>
<dt> Fedora </dt><dd><code>sudo yum install gnupg</code>
</dd>
<dt> OpenSUSE </dt><dd><code>sudo zypper install gnupg</code>
</dd>
<dt> Arch </dt><dd><code>sudo pacman -S gnupg</code>
</dd>
<dt> Gentoo </dt><dd><code>sudo emerge --ask app-crypt/gnupg</code>
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <code>git-remote-gcrypt</code></h3>
<div class="outline-text-3" id="text-1-3">
<p>
Ferramenta que auxilia a criptografia completa de remotos utilizando chaves
públicas <code>gnupg</code> dos participantes do repositório.
</p>

<p>
Para instalar:
</p>

<dl class="org-dl">
<dt> Debian/Ubuntu </dt><dd><code>sudo apt-get install git-remote-gcrypt</code>
</dd>
<dt> AUR (Arch) </dt><dd><code>yay -Sa git-remote-gcrypt</code>
</dd>
</dl>

<p>
Caso você não utilize essas distribuições, siga os seguintes passos:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">usuario@pc-local</span>

<span style="color: #d3869b;">git</span> clone https://github.com/spwhitton/git-remote-gcrypt.git
<span style="color: #fe8019;">cd</span> git-remote-gcrypt
./install.sh
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> <code>ecryptfs</code></h3>
<div class="outline-text-3" id="text-1-4">
<p>
Chamado também de "gnupg para filesystems", essa é a ferramenta por trás da
criptografia do diretório Home nativa da distribuição Ubuntu. O código fonte da
ferramenta foi integrado no repositório do kernel Linux, e o pacote para a
utilização simples em linha de comando pode ser instalada da seguinte maneira:
</p>

<dl class="org-dl">
<dt> Debian/Ubuntu </dt><dd><code>sudo apt-get install ecryptfs-utils</code>
</dd>
<dt> Fedora </dt><dd><code>sudo yum install ecryptfs-utils</code>
</dd>
<dt> OpenSUSE </dt><dd><code>sudo zypper install ecryptfs-utils</code>
</dd>
<dt> Arch </dt><dd><code>sudo pacman -S ecryptfs-utils</code>
</dd>
<dt> Gentoo </dt><dd><code>sudo emerge --ask sys-fs/ecryptfs-utils</code>
</dd>
</dl>

<p>
Podemos agora facilmente criar um diretório privado para cada usuário utilizando
essas ferramentas, porém note que, utilizando interfaces menos simples, é
possível criar mais diretórios transparentes.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> <code>openssh</code></h3>
<div class="outline-text-3" id="text-1-5">
<p>
Uma das implementações mais populares de ferramentas que utilizam o
protocolo SSH, a suite OpenSSH implementa vários programas essenciais para
quaisquer sistemas cliente-servidor.
</p>

<dl class="org-dl">
<dt> Debian/Ubuntu </dt><dd><code>sudo apt-get install openssh-server openssh-client</code>
</dd>
<dt> Fedora </dt><dd><code>sudo yum install openssh-server openssh</code>
</dd>
<dt> OpenSUSE </dt><dd><code>sudo zypper install openssh</code>
</dd>
<dt> Arch </dt><dd><code>sudo pacman -S openssh</code>
</dd>
<dt> Gentoo </dt><dd><code>sudo emerge --ask --changed-use net-misc/openssh</code>
</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Criação e inicialização</h2>
<div class="outline-text-2" id="text-2">
<p>
A fim de administrar um servidor <code>git</code> e seus repositórios, precisamos, claro,
criar e inicializar a aparelhagem necessária para isso. As tarefas aqui estão
separadas somente para facilitar o entendimento desse guia, porém note que, se
não explicitado, todos os passos <b>precisam</b> ser seguidos.
</p>
</div>
