admin.org
** Criando um usuário

A fim de fornecer acesso externo dos diretórios contendo os repositórios que
desejamos hospedar, criaremos um novo usuário na nossa máquina remota. Esse
usuário guardará as chaves públicas dos usuários dos nossos repositórios.

Em outras palavras, *somente* forneceremos acesso desses repositórios através do
protocolo SSH.

Sendo assim, chamaremos nosso usuário de =gith=, que significa /git host/.
Sempre que necessitarmos realizar operações enquanto esse usuário, utilizaremos
esse nome.

#+begin_src bash :exports code
# admin@servidor-remoto

sudo adduser gith
su gith
cd ~
#+end_src

Então, enquanto =gith=, criaremos o /dotfile/ correspondente à suite SSH:

#+begin_src bash :exports code
# gith@servidor-remoto

# criando o repositório .ssh
mkdir .ssh && chmod 700 .ssh
touch .ssh/authorized_keys && chmod 600 .ssh/authorized_keys
#+end_src

Enfim, eventualmente daremos acesso dos nossos usuários aos repositórios. Para
isso, siga os passos explicitados na seção [[Fornecendo acesso ao servidor]].

Agora podemos criar o repositório de fato...

** Criando um repositório

Com os usuários autorizados para a comunicação por SSH, inicie o repositório
numa pasta que julgar adequada.

Comece com a criação da pasta no local desejado (e garanta que o usuário =gith=
seja o dono dessa pasta). Aqui criaremos nossos repositórios na pasta
=/srv/git=.

#+begin_src bash :exports code
# admin@servidor-remoto

sudo mkdir -p /srv/git
sudo chown -R gith:gith /srv/git
#+end_src

Então, inicie o repositório enquanto usuário =gith=.

#+begin_src bash :exports code
# gith@servidor-remoto

cd /srv/git
mkdir projeto.git
cd projeto.git
git init --bare
#+end_src

Com o repositório remoto criado, podemos iniciá-lo na nossa cópia local...

** Inicializando a cópia local

Como esse guia visa a criação de um repositório hospedado localmente e
criptografado em ambos remoto e cópias locais, precisamos, antes de criar o
primeiro =commit= do repositório, inicializar nossas ferramentas de
criptografia.

*** Criando um diretório criptografado

#+begin_quote
Esse passo é *opcional* para caso você queira de início proteger o acesso aos
dados do repositório no seu computador *local*.
#+end_quote

Utilizando a ferramenta =ecryptfs=, criaremos um diretório privado para o
usuário na sua Home, com o intuito de guardar os dados do repositório remoto.

#+begin_src bash :exports code
# admin@pc-admin

# certifique-se que o módulo do kernel está carregado
modprobe ecryptfs

# configure o diretório privado, seguindo os passos dados pela aplicação
ecryptfs-setup-private --nopwcheck --noautomount
# o mount point default é em ~/Private
mv ~/Private ~/meu_projeto
echo $(readlink -f meu_projeto) > ~/.ecryptfs/Private.mnt
#+end_src

Reinicie seu sistema, como informado pela ferramenta, e, ao retornar, realize o
/mount/ do diretório.

#+begin_src bash :exports code
# admin@pc-admin

ecryptfs-mount-private
#+end_src


Assim teremos um diretório criptografado de maneira transparente pela
ferramenta.

*** Criando a primeira versão

Agora podemos iniciar a configuração da criptografia do remoto através do URI
especial da ferramenta =git-remote-gcrypt=:

#+begin_src bash :exports code
# admin@pc-admin

cd ~/meu_projeto
git init
git remote add origin gcrypt::gith@servidor:/srv/git/projeto.git
#+end_src

Agora adicionamos as chaves =gpg= dos colaboradores. Garanta que ao menos sua
chave GnuPG seja adicionada, para que num segundo momento você possa adicionar o
restante dos colaboradores.

#+begin_src bash :exports code
# admin@pc-admin

# para visualizar as chaves públicas no seu keyring, utilize:
gpg --list-keys --keyid-format long
# adicione as chaves publicas dos participantes:
git config remote.origin.gcrypt-participants \
    "ID-CHAVE-JOÃO ID-CHAVE-MARIA ID-CHAVE-JOSÉ"
#+end_src

Note que a processo de importação das chaves GnuPG é abordado na seção
[[Importando as chaves dos colaboradores]]. Além disso, abordamos com mais
detalhe o processo de adição de colaboradores em [[Adicionando novos
colaboradores a um repositório]].

Com isso, finalmente podemos inicializar o repositório com arquivos:

#+begin_src bash :exports code
# admin@pc-admin

vim README.md
git add README.md
git commit -m "commit inicial"
git push -u origin master
#+end_src

Com isso, agora garantimos o acesso restrito aos dados do nosso repositório por
*somente* os participantes que listamos!

** Configurando o usuário =gith=

#+begin_quote
Esse passo é *opcional*, e está aqui para garantir que os colaboradores não
tenham acesso interativo por sessão SSH.
#+end_quote

A fim de que esse usuário somente realize comandos =git=, altere sua =shell=
padrão para a =git-shell=, que está incluída no pacote =git=.

#+begin_src bash :exports code
# admin@servidor-remoto

sudo chsh gith -s $(which git-shell)
#+end_src

Assim, nenhum dos colaboradores que adicionaremos poderá iniciar uma sessão
interativa por SSH pelo usuário =gith=.

* Tarefas recorrentes

Nessa seção, lidaremos com tarefas que se repetirão durante o desenvolvimento de
qualquer projeto. Isto é, lidaremos com a gerência de usuários.

