org-exports/admin.html

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Criando um usuário</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A fim de fornecer acesso externo dos diretórios contendo os repositórios que
desejamos hospedar, criaremos um novo usuário na nossa máquina remota. Esse
usuário guardará as chaves públicas dos usuários dos nossos repositórios.
</p>

<p>
Em outras palavras, <b>somente</b> forneceremos acesso desses repositórios através do
protocolo SSH.
</p>

<p>
Sendo assim, chamaremos nosso usuário de <code>gith</code>, que significa <i>git host</i>.
Sempre que necessitarmos realizar operações enquanto esse usuário, utilizaremos
esse nome.
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">admin@servidor-remoto</span>

<span style="color: #d3869b;">sudo</span> adduser gith
<span style="color: #d3869b;">su</span> gith
<span style="color: #fe8019;">cd</span> ~
</pre>
</div>

<p>
Então, enquanto <code>gith</code>, criaremos o <i>dotfile</i> correspondente à suite SSH:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">gith@servidor-remoto</span>

<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">criando o reposit&#243;rio .ssh</span>
<span style="color: #d3869b;">mkdir</span> .ssh &amp;&amp; <span style="color: #d3869b;">chmod</span> 700 .ssh
<span style="color: #d3869b;">touch</span> .ssh/authorized_keys &amp;&amp; <span style="color: #d3869b;">chmod</span> 600 .ssh/authorized_keys
</pre>
</div>

<p>
Enfim, eventualmente daremos acesso dos nossos usuários aos repositórios. Para
isso, siga os passos explicitados na seção <a href="#sec-3-1">Fornecendo acesso dos repositórios</a>.
</p>

<p>
Agora podemos criar o repositório de fato&#x2026;
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Criando um repositório</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Com os usuários autorizados para a comunicação por SSH, inicie o repositório
numa pasta que julgar adequada.
</p>

<p>
Comece com a criação da pasta no local desejado (e garanta que o usuário <code>gith</code>
seja o dono dessa pasta). Aqui criaremos nossos repositórios na pasta
<code>/srv/git</code>.
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">admin@servidor-remoto</span>

<span style="color: #d3869b;">sudo</span> <span style="color: #d3869b;">mkdir</span> -p /srv/git
<span style="color: #d3869b;">sudo</span> <span style="color: #d3869b;">chown</span> -R gith:gith /srv/git
</pre>
</div>

<p>
Então, inicie o repositório enquanto usuário <code>gith</code>.
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">gith@servidor-remoto</span>

<span style="color: #fe8019;">cd</span> /srv/git
<span style="color: #d3869b;">mkdir</span> projeto.git
<span style="color: #fe8019;">cd</span> projeto.git
<span style="color: #d3869b;">git</span> init --bare
</pre>
</div>

<p>
Com o repositório remoto criado, podemos iniciá-lo na nossa cópia local&#x2026;
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Inicializando a cópia local</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Como esse guia visa a criação de um repositório hospedado localmente e
criptografado em ambos remoto e cópias locais, precisamos, antes de criar o
primeiro <code>commit</code> do repositório, inicializar nossas ferramentas de
criptografia.
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Criando um diretório criptografado</h4>
<div class="outline-text-4" id="text-2-3-1">
<blockquote>
<p>
Esse passo é <b>opcional</b> para caso você queira de início proteger o acesso aos
dados do repositório no seu computador <b>local</b>.
</p>
</blockquote>

<p>
Utilizando a ferramenta <code>ecryptfs</code>, criaremos um diretório privado para o
usuário na sua Home, com o intuito de guardar os dados do repositório remoto.
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">admin@pc-admin</span>

<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">certifique-se que o m&#243;dulo do kernel est&#225; carregado</span>
modprobe ecryptfs

<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">configure o diret&#243;rio privado, seguindo os passos dados pela aplica&#231;&#227;o</span>
ecryptfs-setup-private --nopwcheck --noautomount
<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">o mount point default &#233; em ~/Private</span>
<span style="color: #d3869b;">mv</span> ~/Private ~/meu_projeto
<span style="color: #fe8019;">echo</span> $(readlink -f meu_projeto) &gt; ~/.ecryptfs/Private.mnt
</pre>
</div>

<p>
Reinicie seu sistema, como informado pela ferramenta, e, ao retornar, realize o
<i>mount</i> do diretório.
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">admin@pc-admin</span>

ecryptfs-mount-private
</pre>
</div>


<p>
Assim teremos um diretório criptografado de maneira transparente pela
ferramenta.
</p>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Criando a primeira versão</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Agora podemos iniciar a configuração da criptografia do remoto através do URI
especial da ferramenta <code>git-remote-gcrypt</code>:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">admin@pc-admin</span>

<span style="color: #fe8019;">cd</span> ~/meu_projeto
<span style="color: #d3869b;">git</span> init
<span style="color: #d3869b;">git</span> remote add origin gcrypt::gith@servidor:/srv/git/projeto.git
</pre>
</div>

<p>
Agora adicionamos as chaves <code>gpg</code> dos colaboradores. Garanta que ao menos sua
chave GnuPG seja adicionada, para que num segundo momento você possa adicionar o
restante dos colaboradores.
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">admin@pc-admin</span>

<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">para visualizar as chaves p&#250;blicas no seu keyring, utilize:</span>
gpg --list-keys --keyid-format long
<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">adicione as chaves publicas dos participantes:</span>
<span style="color: #d3869b;">git</span> config remote.origin.gcrypt-participants <span style="color: #b8bb26;">\</span>
    <span style="color: #b8bb26;">"ID-CHAVE-JO&#195;O ID-CHAVE-MARIA ID-CHAVE-JOS&#201;"</span>
</pre>
</div>

<p>
Note que a processo de importação das chaves GnuPG é abordado na seção
<a href="#sec-3-2">Importando as chaves dos colaboradores</a>. Além disso, abordamos com mais
detalhe o processo de adição de colaboradores em <a href="#sec-3-3">Adicionando novos colaboradores a um repositório</a>.
</p>

<p>
Com isso, finalmente podemos inicializar o repositório com arquivos:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">admin@pc-admin</span>

vim README.md
<span style="color: #d3869b;">git</span> add README.md
<span style="color: #d3869b;">git</span> commit -m <span style="color: #b8bb26;">"commit inicial"</span>
<span style="color: #d3869b;">git</span> push -u origin master
</pre>
</div>

<p>
Com isso, agora garantimos o acesso restrito aos dados do nosso repositório por
<b>somente</b> os participantes que listamos!
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Configurando o usuário <code>gith</code></h3>
<div class="outline-text-3" id="text-2-4">
<blockquote>
<p>
Esse passo é <b>opcional</b>, e está aqui para garantir que os colaboradores não
tenham acesso interativo por sessão SSH.
</p>
</blockquote>

<p>
A fim de que esse usuário somente realize comandos <code>git</code>, altere sua <code>shell</code>
padrão para a <code>git-shell</code>, que está incluída no pacote <code>git</code>.
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">admin@servidor-remoto</span>

<span style="color: #d3869b;">sudo</span> chsh gith -s $(<span style="color: #d3869b;">which</span> git-shell)
</pre>
</div>

<p>
Assim, nenhum dos colaboradores que adicionaremos poderá iniciar uma sessão
interativa por SSH pelo usuário <code>gith</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Tarefas recorrentes</h2>
<div class="outline-text-2" id="text-3">
<p>
Nessa seção, lidaremos com tarefas que se repetirão durante o desenvolvimento de
qualquer projeto. Isto é, lidaremos com a gerência de usuários.
</p>
</div>
