admin.org
** Fornecendo acesso ao servidor

#+begin_note
*ATENÇÃO*: A criação das chaves simétricas não é abordada nesse guia. Para isso,
peça que seus usuários leiam o [[./user.org][guia para usuários]]. Nele, criamos
chaves simétricas através das ferramentas da /suite/ OpenSSH.
#+end_note

Primeiro peça aos usuários que enviem a porção pública de suas chaves
simétricas:

#+begin_src bash :exports code
# usuario@pc-usuario

cat $HOME/.ssh/*.pub
# os nomes padrão para chaves são id_* e id_*.pub
#+end_src

Com a chave pública em mãos, adicione a chave na lista de chaves autorizadas do
usuário =gith=.

#+begin_src bash :exports code
# gith@servidor-remoto

cat <CAMINHO_CHAVE_PUBLICA_USUARIO> >> ~/.ssh/authorized_keys
#+end_src

** Importando as chaves dos colaboradores

#+begin_note
*ATENÇÃO*: A criação das chaves GnuPG não é abordada nesse guia. Para isso, peça
que seus usuários leiam o [[./user.org][guia para usuários]].
#+end_note

Para importar as chaves privadas dos colaboradores, peça que executem os
seguintes comandos:

#+begin_src bash :exports code
# usuario@pc-usuario

gpg --list-keys --keyid-format long
#+end_src

Na saída do comando, os usuários verão uma lista no seguinte formato:

#+begin_example
/home/<USUARIO>/.gnupg/pubring.kbx
---------------------------------
pub   <TIPO_E_TAMANHO>/<ID_LONGO> <DATA_CRIACAO>
      <FINGERPRINT_COMPLETO>
uid                 <COMENTARIOS>
sub   <TIPO_E_TAMANHO>/<ID_SUBCHAVE> <DATA_CRIACAO> [E]
#+end_example

Após identificar a chave que escolheram, peça que a exportem através do seguinte
comando:

#+begin_src bash :exports code
# usuario@pc-usuario

gpg --armor --export <ID_LONGO> > chave_usuario.asc
#+end_src

E que enviem esse arquivo para o administrador responsável (você). Assim, para
importar as chaves dos colaboradores, execute:

#+begin_src bash :exports code
# admin@pc-admin

gpg --import chave_usuario.asc
#+end_src

** Adicionando novos colaboradores a um repositório

#+begin_note
*ATENÇÃO*: A criação das chaves GnuPG não é abordada nesse guia. Para isso, peça
que seus usuários leiam o [[./user.org][guia para usuários]].
#+end_note

Esse processo foi rapidamente abordado na seção [[Criando a primeira versão]],
porém, embora direto ao ponto, existem alguns detalhes essenciais nesse
processo.

Claro, o processo de adição ou remoção de participantes é simples:

#+begin_src bash :exports code
# usuario@pc-usuario

# inicialmente só temos a (nossa) CHAVE1
git config remote.origin.gcrypt-participants "CHAVE1"

# adicionamos a chave de outro colaborador da seguinte maneira
git config remote.origin.gcrypt-participants "CHAVE1 CHAVE2"
#+end_src

onde as chaves listadas são os identificadores longos de chaves GnuPG obtidos
através do comando =gpg --list-keys --keyid-format long=.

Para enfim atualizarmos o repositório e, efetivamente, adicionar esses
colaboradores, *precisamos criar uma nova versão*. Isto é:

#+begin_src bash :exports code
# usuario@pc-usuario

# realizamos alguma mudanca
vim README.md
# e criamos o novo commit
git commit -am "added colaborator"
git push
#+end_src

Efetivamente, esse push irá adicionar ao =Manifest= do nosso repositório as
chaves publicas dos participantes. Isso é essencial, já que *todos* os
participantes devem possuir as chaves públicas do restante dos participantes.

A cada push o =Manifest= será atualizado conforme o necessário, então garanta
que você e seus usuários possuam em seus /keyrings/ as chaves públicas dos
participantes do repositório.
