org-exports/admin.html

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Fornecendo acesso dos repositórios</h3>
<div class="outline-text-3" id="text-3-1">
<div class="note">
<p>
<b>ATENÇÃO</b>: A criação das chaves simétricas não é abordada nesse guia. Para isso,
peça que seus usuários leiam o <a href="./user.html">guia para usuários</a>. Nele, criamos
chaves simétricas através das ferramentas da <i>suite</i> OpenSSH.
</p>

</div>

<p>
Primeiro peça aos usuários que enviem a porção pública de suas chaves
simétricas:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">usuario@pc-usuario</span>

<span style="color: #d3869b;">cat</span> $<span style="color: #83a598;">HOME</span>/.ssh/*.pub
<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">os nomes padr&#227;o para chaves s&#227;o id_* </span><span style="color: #7c6f64;">e</span><span style="color: #7c6f64;"> id_*.pub</span>
</pre>
</div>

<p>
Com a chave pública em mãos, adicione a chave na lista de chaves autorizadas do
usuário <code>gith</code>.
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">gith@servidor-remoto</span>

<span style="color: #d3869b;">cat</span> &lt;CAMINHO_CHAVE_PUBLICA_USUARIO&gt; &gt;&gt; ~/.ssh/authorized_keys
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Importando as chaves dos colaboradores</h3>
<div class="outline-text-3" id="text-3-2">
<div class="note">
<p>
<b>ATENÇÃO</b>: A criação das chaves GnuPG não é abordada nesse guia. Para isso, peça
que seus usuários leiam o <a href="./user.html">guia para usuários</a>.
</p>

</div>

<p>
Para importar as chaves privadas dos colaboradores, peça que executem os
seguintes comandos:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">usuario@pc-usuario</span>

gpg --list-keys --keyid-format long
</pre>
</div>

<p>
Na saída do comando, os usuários verão uma lista no seguinte formato:
</p>

<pre class="example">
/home/&lt;USUARIO&gt;/.gnupg/pubring.kbx
---------------------------------
pub   &lt;TIPO_E_TAMANHO&gt;/&lt;ID_LONGO&gt; &lt;DATA_CRIACAO&gt;
      &lt;FINGERPRINT_COMPLETO&gt;
uid                 &lt;COMENTARIOS&gt;
sub   &lt;TIPO_E_TAMANHO&gt;/&lt;ID_SUBCHAVE&gt; &lt;DATA_CRIACAO&gt; [E]
</pre>

<p>
Após identificar a chave que escolheram, peça que a exportem através do seguinte
comando:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">usuario@pc-usuario</span>

gpg --armor --export &lt;ID_LONGO&gt; &gt; chave_usuario.asc
</pre>
</div>

<p>
E que enviem esse arquivo para o administrador responsável (você). Assim, para
importar as chaves dos colaboradores, execute:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">admin@pc-admin</span>

gpg --import chave_usuario.asc
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Adicionando novos colaboradores a um repositório</h3>
<div class="outline-text-3" id="text-3-3">
<div class="note">
<p>
<b>ATENÇÃO</b>: A criação das chaves GnuPG não é abordada nesse guia. Para isso, peça
que seus usuários leiam o <a href="./user.html">guia para usuários</a>.
</p>

</div>

<p>
Esse processo foi rapidamente abordado na seção <a href="#sec-2-3-2">Criando a primeira versão</a>,
porém, embora direto ao ponto, existem alguns detalhes essenciais nesse
processo.
</p>

<p>
Claro, o processo de adição ou remoção de participantes é simples:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">usuario@pc-usuario</span>

<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">inicialmente s&#243; temos a (nossa) CHAVE1</span>
<span style="color: #d3869b;">git</span> config remote.origin.gcrypt-participants <span style="color: #b8bb26;">"CHAVE1"</span>

<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">adicionamos a chave de outro colaborador da seguinte maneira</span>
<span style="color: #d3869b;">git</span> config remote.origin.gcrypt-participants <span style="color: #b8bb26;">"CHAVE1 CHAVE2"</span>
</pre>
</div>

<p>
onde as chaves listadas são os identificadores longos de chaves GnuPG obtidos
através do comando <code>gpg --list-keys --keyid-format long</code>.
</p>

<p>
Para enfim atualizarmos o repositório e, efetivamente, adicionar esses
colaboradores, <b>precisamos criar uma nova versão</b>. Isto é:
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">usuario@pc-usuario</span>

<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">realizamos alguma mudanca</span>
vim README.md
<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">e</span><span style="color: #7c6f64;"> criamos o novo commit</span>
<span style="color: #d3869b;">git</span> commit -am <span style="color: #b8bb26;">"added colaborator"</span>
<span style="color: #d3869b;">git</span> push
</pre>
</div>

<p>
Efetivamente, esse push irá adicionar ao <code>Manifest</code> do nosso repositório as
chaves publicas dos participantes. Isso é essencial, já que <b>todos</b> os
participantes devem possuir as chaves públicas do restante dos participantes.
</p>

<p>
A cada push o <code>Manifest</code> será atualizado conforme o necessário, então garanta
que você e seus usuários possuam em seus <i>keyrings</i> as chaves públicas dos
participantes do repositório.
</p>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">Sumário</a></li>
<li><a href="#sec-1">1. Preâmbulo</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. <code>git</code></a></li>
<li><a href="#sec-1-2">1.2. <code>gnupg</code></a></li>
<li><a href="#sec-1-3">1.3. <code>git-remote-gcrypt</code></a></li>
<li><a href="#sec-1-4">1.4. <code>ecryptfs</code></a></li>
<li><a href="#sec-1-5">1.5. <code>openssh</code></a></li>
</ul>
</li>
<li><a href="#sec-2">2. Criação e inicialização</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Criando um usuário</a></li>
<li><a href="#sec-2-2">2.2. Criando um repositório</a></li>
<li><a href="#sec-2-3">2.3. Inicializando a cópia local</a></li>
<li><a href="#sec-2-4">2.4. Configurando o usuário <code>gith</code></a></li>
</ul>
</li>
<li><a href="#sec-3">3. Tarefas recorrentes</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Fornecendo acesso dos repositórios</a></li>
<li><a href="#sec-3-2">3.2. Importando as chaves dos colaboradores</a></li>
<li><a href="#sec-3-3">3.3. Adicionando novos colaboradores a um repositório</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Autor: Henrique Silva</p>
<p class="date">Criado em: 2020-02-21 sex 00:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="http://orgmode.org">Org-mode</a> 9.3.4)</p>
</div>
</footer>
</body>
</html>
